Repository: loginom/loginom-help-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Шаблон — в этом поле происходит настройка шаблона для отображения метки интервала, в нем можно составить пользовательский шаблон или при нажатии на выбрать один из готовых шаблонов.
en: Template: this field is used to configure a template to display bin caption. It is possible to create a user template in it, or select one of ready templates by pressing .

source: Шагов автоподбора не более — максимальное количество шагов алгоритма (0 — отключение ограничения);
en: Autofit stages not more: the maximum number of the algorithm steps (0 — restrictions are disabled).

source: Шагов построения.
en: Model steps.

source: Экранировать одинарные и двойные кавычки — замена в выходном файле одинарных кавычек на обозначение &apos; и двойных на &quot;.
en: Escape single and double quotes: replacement of single quotes in the output file to &apos; and double quotes to &quot;.

source: Экранировать одинарные и двойные кавычки — замена в результирующем XML одинарных кавычек на обозначение &apos; и двойных на &quot;.
en: Escape single and double quotes: replacement of single quotes in the resulting XML to &apos; and double quotes to &quot;.

source: Экранировать табуляции и переводы строк в атрибутах — замена в атрибутах выходного файла символов табуляции на обозначение &#x9; и символа перевода строк на &#xA;
en: Escape tabs and line breaks in attributes: replacement of tab characters in attributes of the output file to &#x9; and line feed character to &#xA;

source: Экранировать табуляции и переводы строк в атрибутах — замена в атрибутах результирующего XML символов табуляции на обозначение &#x9; и символа перевода строк на &#xA;
en: Escape tabs and line breaks in attributes: replacement of tab characters in attributes of the resulting XML to&#x9; and line feed character to &#xA;

source: Экспоненциальная форма — отображение числа в нормализованной форме (степени числа 10).
en: Exponential form: display of digit in the normalized form (powers of 10).

source: Экспорт XML
en: XML Export;

source: Экспорт данных
en: Data export

source: Экспорт Экспорт в файл (XLS):
en: Export Export to file (XLS):

source: Экспорт Экспорт — сохраняет таблицу замен в указанный текстовый файл.
en: Export Export enables to save the replacement table in the specified text file.

source: Экспорт Экспорт — экспорт таблицы замен в текстовый файл;
en: Export Export provides export of the replacement table to the text file.

source: Экспорт — позволяет экспортировать диаграмму в определённый формат:
en: Export enables to export the chart to the given format:

source: Экспорт — раздел предназначен для описания узлов наполнения внешних систем обработанными данными с целью их дальнейшего хранения, использования, пересылки или публикации;
en: Export. The section is designated for description of the nodes used for filling the external systems with the processed data for their further storage, use, transfer or publication.

source: Экстра (EXTRA).
en: Extra (EXTRA).

source: Экстремум К.
en: Correlation function

source: Экстремум взаимнокорреляционной функции — вычисляет максимальный по модулю из коэффициентов корреляции двух процессов, рассчитанных при всевозможных временных сдвигах.
en: Extremum of cross-correlation function enables to calculate the maximum absolute value of the correlation coefficients of two processes calculated for all possible time shifts.

source: автоматически — обработчик определит область расчета, исходя из количества отсчетов самостоятельно.
en: Auto : the handler will define the calculation area according to the lag count independently.

source: активировать подключение — активировать подключение.
en: Activate connection — activate connection.

source: активировать Активировать подключение.
en: activate Activate connection.

source: в столбцы — каждой переменной будет соответствовать отдельное поле таблицы;
en: to columns: each variable will correspond to a separate table field.

source: в строки — каждой переменной будет соответствовать отдельная запись таблицы.
en: to strings: each variable will correspond to a separate table record.

source: ввод вручную — использовать таблицу замен.
en: Manual input: it is required to use the replacement table.

source: временная — рекомендуется при обработке небольшого количества отсчетов;
en: Time is recommended in the case of the small lag count processing.

source: выводить Выводить — определяет будет ли добавлен этот элемент в виде поля в выходной набор данных;
en: show Show enables to define whether this item will be added in the form of a field to the output data set.

source: группировать список — включение группировки списка по видам подключений;
en: Group list — include the list grouping by connection kinds;

source: данные):
en: data):

source: доступ Настроить модификатор доступа…;
en: access Configure visibility…;

source: интерактивный режим работы).
en: Interactive mode of operation).

source: искать по списку — поиск подключения по имени/пути, возможно искать в разных группах;
en: search in list — search for connection by name/path, it is possible to search in different groups;

source: крупная плитка — отображение в виде крупной плитки;
en: Large tiles — large tiles view;

source: кэширование).
en: caching).

source: локальное — подключение без использования сервера Firebird, указывается только путь к БД.
en: Local: connection without the use of the Firebird server; only a path to the DB is specified.

source: локальное — подключение без использования сервера Interbase, указывается только путь к БД.
en: Local: connection without the use of the Interbase server; only a path to the DB is specified.

source: модификатор доступа), в котором Производный компонент был создан.
en: the access modifier) in which the Derived Component has been created.

source: модификатора доступа).
en: access modifier).

source: на значение — значения будут заменены на указанное.
en: With value: values will be replaced with the specified value.

source: на пропущенное — значения будут заменены на "NULL".
en: With empty: values will be replaced with "NULL".

source: на регулярное выражение — новое значение будет вычислено с использованием синтаксиса регулярного выражения.
en: With regular expression: the new value will be calculated using the regular expression syntax.

source: настроить модификатор доступа — настроить модификатор доступа;
en: Configure visibility — configure visibility;

source: настроить подключение — настроить подключение;
en: Configure connection — configure connection;

source: настроить Настроить подключение…;
en: configure Configure connection…;

source: не заменять — замены производиться не будут.
en: Do not replace: no replacement is performed.

source: не заменять — замены производиться не будут;
en: Do not replace: no replacement is performed.

source: параметры поля набора данных).
en: features of data set field).

source: переименовать Переименовать подключение…;
en: rename Rename connection…;

source: показать дерево — показать дерево классов подключений;
en: Show tree — show connection class tree;

source: протокол — протокол, используемый сервером для взаимодействия с клиентом.
en: Protocol: the protocol that is used by the server for interaction with a client.

source: регулярному выражению.
en: regular expression.

source: сервер — хост сервера Firebird.
en: Server: the Firebird server host.

source: сервер — хост сервера Interbase.
en: Server: the Interbase server host.

source: скрыть дерево — скрыть дерево классов подключений;
en: Hide tree — hide connection class tree;

source: сортировать список — сортировка.
en: Sort list — sorting.

source: таблица — отображение в виде таблицы;
en: Table — table view;

source: точному совпадению;
en: exact match;

source: удаленное — подключение с использованием сервера Firebird.
en: Remote: connection with the use of the Firebird server.

source: удаленное — подключение с использованием сервера Interbase.
en: Remote: connection with the use of the Interbase server.

source: удалить подключение — удалить подключение;
en: Delete connection: delete connection;

source: удалить Удалить подключение…;
en: delete Delete connection…;

source: управление ходом выполнения сценария).
en: workflow progress control).

source: фильтровать список — фильтрация по группам/меткам/пути подключения;
en: Filter list — filtering by groups/captions/path of connection;

source: частотная — рекомендуется при обработке большого количества отсчетов для ускорения вычислений;
en: Frequency is recommended in the case of the large lag count processing to speed up the calculation process.

source: экспорт в HTML — сохранить текущее представление в формате HTML.
en: export to HTML: save the current view in the HTML format.

source: экспорт в XLS (html) — сохранить текущее представление в формате Excel.
en: export to XLS (html): save the current view in the Excel format.

source: № — номер интервала;
en: No — bin number;

source: № — номер строки в исходном наборе данных (например, после фильтрации).
en: №: row number in the source data set (for example, after filtration).

source: № — номер уникального значения.
en: №: the unique value number.

source: инструментарий проектирования).
en: design tool).

source: OCR называется Общей точностью классификации. $$\displaystyle\mathsf{OCR=\frac{TP+TN}{P+N}=\frac{TP+TN}{TP+TN+FP+FN}}$$.
en: OCR is called Overall classification rate. $$\displaystyle\mathsf{OCR=\frac{TP+TN}{P+N}=\frac{TP+TN}{TP+TN+FP+FN}}$$.

source: PPV называется Точностью отрицательного прогноза классификации. $$\displaystyle\mathsf{NPV=\frac{TN}{TN+FN}}$$.
en: PPV is called Negative prediction value of classification. $$\displaystyle\mathsf{NPV=\frac{TN}{TN+FN}}$$.

source: PPV называется Точностью положительного прогноза классификации. $$\displaystyle\mathsf{PPV=\frac{TP}{TP+FP}}$$.
en: PPV is called Positive predictive value of classification. $$\displaystyle\mathsf{PPV=\frac{TP}{TP+FP}}$$.

source: TNR называется Специфичностью классификации. $$\displaystyle\mathsf{TNR=\frac{TN}{N}=\frac{TN}{TN+FP}=1−FPR}$$.
en: TNR is called Specificity of classification. $$\displaystyle\mathsf{TNR=\frac{TN}{N}=\frac{TN}{TN+FP}=1−FPR}$$.

source: TPR называется Чувствительностью классификации. $$\displaystyle\mathsf{TPR=\frac{TP}{P}=\frac{TP}{TP+FN}=1−FNR}$$.
en: TPR is called sensitivity of classification. $$\displaystyle\mathsf{TPR=\frac{TP}{P}=\frac{TP}{TP+FN}=1−FNR}$$.

source: Мутации).
en: Mutations).

source: Описание структуры результирующего набора.
en: Description of structure of resulting data set.

source: Описание структуры таблицы диапазонов.
en: Description of structure of range table.

source: Полное описание API).
en: Full API Description).

source: Применение допустимого интервала.
en: Use of the Allowable Interval.

source: виды данных).
en: data kinds).

source: назначение и структура пакета) и представляет собой последовательность шагов по обработке данных.
en: package usage type and structure).It is a sequence of the data processing steps.

source: типы данных).
en: data types).

source: типы данных):
en: data types):

source: автоматическая синхронизация полей).
en: Automapping of Fields).

source: автоматическая синхронизация полей);
en: automapping of fields);

source: интерфейс «Таблица» и интерфейс «Связи»).
en: "Table" interface and "Connections" interface).

source: совместимость типов данных).
en: Compatibility of data types).

source: структуру выходного набора.
en: output data set structure.

source: "Первый сценарий").
en: "The first workflow").

source: Пример подключения и работы с БД.
en: Example of the DB connection and operation.

source: Примеры).
en: Examples).

source: пакетное выполнение сценариев)
en: batch processing of workflows)

source: параметры поля набора данных)
en: Features of data set field).

source: OPR называется Усредненной точностью прогноза. $$\displaystyle\mathsf{OPR=\frac{PPV+NPV}{2}}$$.
en: OPR means the Overall Precision Rate. $$\displaystyle\mathsf{OPR=\frac{PPV+NPV}{2}}$$.

source: An - коэффициенты регрессии,
en: An - regression coefficients.

source: C - постоянная,
en: C - constant.

source: Cлева находится панель компонентов, состоящая из следующих категорий:
en: The panel of components is located on the left. It consists of the following categories:

source: Deductor Warehouse реализует универсальное многомерное хранение, т.е. может содержать множество процессов с различным количеством измерений и фактов.
en: Deductor Warehouse provides the universal multidimensional storage, namely, it can contain a set of processes with different number of dimensions and measures.

source: Desktop-версия Loginom
en: Desktop Loginom Version

source: EM Кластеризация.
en: EM clustering.

source: Excel 2003 (расширение .xls).
en: Excel 2003 (.xls extension).

source: Excel 2003 (расширение .xls);
en: Excel 2003 (.xls extension);

source: Excel 2007 (расширение .xlsx).
en: Excel 2007 (.xlsx extension).

source: I am " + __filename); exports.filename = module.filename; // возвращает полный путь к child_module.js exports.parent = module.parent.id; // возвращает идентификатор вызывающего модуля exports.loaded = module.loaded; // возвращает true или false - был ли загружен модуль
en: I am " + __filename); exports.filename = module.filename; // returns the full path to child_module.js exports.parent = module.parent.id; // returns the identifier of the calling module exports.loaded = module.loaded; // returns true or false - whether the module was loaded

source: IF(IsNull(gate_one),gate_two,gate_one) // однострочный комментарий продолжается до конца строки.
en: IF(IsNull(gate_one),gate_two,gate_one) // single-line comment continues until the end of the string.

source: IF(IsNull(var_one),var_two,var_one) // однострочный комментарий продолжается до конца строки /* Многострочным комментарием считаются все символы, содержащиеся между (слеш-звездочка)
en: IF(IsNull(var_one),var_two,var_one) // single-line comment continues until the end of the string /* The multi-line comment is represented by all characters included between (slash-asterisk)

source: IF, IFF — имеется аналог в JS: if (<условие>) {...};
en: IF, IFF: there is an analogue in JS: if (<condition>) {...}.

source: IIS 8.0 и выше, .NET Framework 4.5
en: IIS 8.0 and higher, .NET Framework 4.5

source: IP адрес или имя хоста сервера Loginom.
en: IP address or host name of the Loginom server.

source: IsNull(row: number): boolean; } // Доступ к итерируемому списку столбцов по имени и индексу interface IColumns extends Iterable<IColumn> {
en: IsNull(row: number): boolean; } // Access to iterated list of columns by name and index interface IColumns extends Iterable<IColumn> {

source: IsNull(row: number, col: number | string): boolean; } // Для выходного набора определены дополнительные методы interface IOutputTable extends IDataSource {
en: IsNull(row: number, col: number | string): boolean; } // Additional methods are defined for the output data set interface IOutputTable extends IDataSource {

source: K-fold кросс-валидация - входные данные разбиваются на К колод (частей).
en: K-fold cross validation: the input data is divided into K folds (parts).

source: LGD — специальный формат файлов, оптимизированный для работы в Loginom и обеспечивающий максимальную скорость записи и чтения.
en: LGD: the special format of files optimized for work in Loginom. It provides the maximum writing and reading speed.

source: LGD-файл уже содержит в себе всю необходимую информацию о параметрах полей (имя поля, метка, тип данных и др.), что позволяет выполнять экспорт и импорт наборов данных с минимальными настройками.
en: The LGD file already contains all required information on the field features (field name, caption, data type, etc.) that enables to export and import data sets with minimum settings.

source: LGD-файлы
en: LGD Files

source: Lambda - основной коэффициент фильтра, с увеличением которого возрастает сглаживание ряда (при Lambda → ∞ итоговый ряд превращается в линейный тренд, а при Lambda = 0 ряд совпадает с исходным рядом).
en: Lambda is the main filter coefficient with increase of which the series smoothing increases as well (if Lambda → ∞, the final series becomes the linear trend, and if Lambda = 0, the series matches the source series).

source: Loginom имеет возможность работать как с веб-сервисами, так и базами данных и файловыми хранилищами данных (электронные таблицы, текстовые файлы и т.д.).
en: Loginom can work both with web services, databases and file data warehouses (spreadsheets, text files, etc.).

source: Loginom имеет два фирменных источника данных:
en: Loginom has two branded data sources:

source: Loginom предоставляет возможность использования следующих разновидностей циклов:
en: Loginom gives an opportunity to use the following kinds of loops:

source: Loginom — руководство пользователя
en: Loginom — User Manual

source: Microsoft Excel 2007 и выше;
en: Microsoft Excel 2007 and higher;

source: N может принимать любые положительные значения.
en: N can take any positive values.

source: N — количество транзакций, вошедших в кластер.
en: N — count of the transactions included into cluster.

source: OutputTable.Set(i, value); } console.log("RowCount = ", OutputTable.RowCount); // Вывод: RowCount = 2
en: OutputTable.Set(i, value); } console.log("RowCount = ", OutputTable.RowCount); // Outputting: RowCount = 2

source: P(n) } => Class(i) , где P(n) — входной параметр, Class(i) — один из известных классов.
en: P(n) } => Class(i) where P(n) — input parameter, Class(i) — one of the classes known in advance.

source: Predicted, Key, Group, Value, Transaction, Item } // Представление столбцов набора данных interface IColumn extends Iterable<boolean | number | string | Date | undefined> {
en: Predicted, Key, Group, Value, Transaction, Item } // View of the data set columns interface IColumn extends Iterable<boolean | number | string | Date | undefined> {

source: REST-сервису будет отправлено столько запросов, сколько строк во входном наборе данных.
en: REST service will get as many requests as there are rows in the input data set.

source: Replace("A000а00A", "А", "B") вернет строку "B000а00A".
en: Replace("A000а00A", "А", "B") will return string "B000а00A".

source: S — мощность (площадь) кластера.
en: S — cluster size (area).

source: SELECT Период, Номенклатура.Наименование, Количество FROM InformationRegister.КалендарныеПотребностиВНоменклатуре.SliceLast(&Date, Количество > &Count) AS Потребности INNER JOIN Catalog.Номенклатура ON Catalog.Номенклатура.Ссылка = Потребности.Номенклатура WHERE %CONDITION%
en: SELECT Period, Nomenclature.Name, Count FROM InformationRegister.CalendarNeedsInNomenclature.SliceLast(&Date, Count > &Count) AS Needs INNER JOIN Catalog.Nomenclature ON Catalog.Nomenclature.Reference = Needs.Nomenclature WHERE %CONDITION%

source: SELECT Период, Номенклатура.Наименование, Количество FROM InformationRegister.КалендарныеПотребностиВНоменклатуре.SliceLast(&Date, Количество > &Count) AS Потребности INNER JOIN Catalog.Номенклатура ON Catalog.Номенклатура.Ссылка = Потребности.Номенклатура WHERE Номенклатура.Артикул = "4561"
en: SELECT Period, Nomenclature.Name, Count FROM InformationRegister.CalendarNeedsInNomenclature.SliceLast(&Date, Count > &Count) AS Needs INNER JOIN Catalog.Nomenclature ON Catalog.Nomenclature.Reference = Needs.Nomenclature WHERE Nomenclature.ProductItem = "4561"

source: SOAP-сервису может быть отправлено несколько последовательных запросов, формируемых из строк входной таблицы с параметрами запросов.
en: It is possible to send several consequent requests generated from the input table rows with the request parameters to SOAP service.

source: SQL Server 2000 (включая MSDE).
en: SQL Server 2000 (including MSDE).

source: SQL Server 2016, 2014, 2012, 2008 R2, 2008, 2005 (включая Express edition).
en: SQL Server 2016, 2014, 2012, 2008 R2, 2008, 2005 (including Express edition).

source: SQL-запрос
en: SQL Query

source: SQL-запрос.
en: SQL query

source: SQL-операторов аналогов данной операции нет.
en: There are no SQL operators analogues of this operation.

source: Set(col: number | string, value: boolean | number | string | Date | null | undefined): void; } // Представление входной переменной interface IVariable {
en: Set(col: number | string, value: boolean | number | string | Date | null | undefined): void; } // View of input variable interface IVariable {

source: Studio (веб-клиент)
en: Studio (web client)

source: U1 и U2
en: U1 and U2

source: U1, U2 и U3
en: U1, U2 and U3

source: U2, U3 и U4
en: U2, U3 and U4

source: U3 и U4
en: U3 and U4

source: Var0 — пустое значение; Var1 — логическое значение true; Var2 — целое значение 1; Var3 — строковое значение 1; Var4 — строковое значение null; Var5 — пустая строка; Var6 — строковое значение test; Var7 — строковое значение te'st; Var8 — строковое значение "test"; Var9 — строковое значение a b c.
en: Var0 — empty value; Var1 — logical true value; Var2 — integer value 1; Var3 — string value 1; Var4 — string null value; Var5 — empty string; Var6 — string test value; Var7 — string te'st value; Var8 — string "test" value; Var9 — string a b c value.

source: W — ширина кластера, т.е. число уникальных объектов в нем.
en: W — cluster width, namely, the number of the unique objects included into it.

source: WSDL опубликованного SOAP-сервиса можно получить по ссылке:
en: See the link below to get WSDL of the published SOAP service:

source: Windows 7 и выше
en: Windows 7 and higher

source: Windows Server 2012 и выше
en: Windows Server 2012 and higher

source: X(t-n) - значения ряда.
en: X(t-n) - series values.

source: XML-ответы сервиса преобразуются в табличное представление.
en: The service XML responses are transformed to the table view.

source: [index: number]: IColumn; } // Свойства и методы набора данных interface IDataSource {
en: [index: number]: IColumn; } // Properties and methods of data set interface IDataSource {

source: [index: number]: IVariable; } // Представление переменных входного порта interface IVariables {
en: [index: number]: IVariable; } View of input port variables interface IVariables {

source: \Пакеты\Scoring\Расчет скорингового балла\Сценарий
en: \Packages\Scoring\Score calculation\Workflow

source: a(сумма)
en: a(sum)

source: assertion — любое булевое выражение.
en: assertion means any boolean expression.

source: b(сумма)
en: b(sum)

source: c(сумма)
en: c(sum)

source: cache: { [resolvedId: string]: IModule]; }; } // Глобальный объект console var console: Console; interface Console {
en: cache: { [resolvedId: string]: IModule]; }; } // Global console object var console: Console; interface Console {

source: col — индекс или имя столбца.
en: col: column index or name.

source: colOutlook1 = inputTable1.Columns[1]; // Получение ссылки на столбец по индексу // Получение из объекта Columns массива столбцов let arrayOfColumns = Array.from(InputTable.Columns); // Вывод значений свойств столбцов в консоль arrayOfColumns.forEach(column => {
en: colOutlook1 = inputTable1.Columns[1]; // Getting reference to the column by index // Getting the columns array from the Columns object let arrayOfColumns = Array.from(InputTable.Columns); // Outputting the values of the columns properties to the console arrayOfColumns.forEach(column => {

source: console.error(e); }); // или (async () => {
en: console.error(e); }); // or (async () => {

source: console.log(""); } // Перебор входных переменных с использованием итератора for (let variable of InputVariables.Items)
en: console.log(""); } // Iterating over the input variables by means of iterator for (let variable of InputVariables.Items)
